Heat_Transfer/BuoyantSimpleFOAM/circuitBoardCooling/constant/baffle3DRegion/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/baffle3DRegion/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    bottom
    {
        type            mappedWall;
        inGroups        3(baffleFacesThermoBaffle3DGroup_master wall mappedPatch);
        nFaces          16;
        startFace       1534;
        sampleMode      nearestPatchFace;
        coupleGroup     baffleFacesThermoBaffle3DGroup_master;
    }
    top
    {
        type            mappedWall;
        inGroups        3(baffleFacesThermoBaffle3DGroup_slave wall mappedPatch);
        nFaces          16;
        startFace       1550;
        sampleMode      nearestPatchFace;
        coupleGroup     baffleFacesThermoBaffle3DGroup_slave;
    }
    side
    {
        type            patch;
        nFaces          1700;
        startFace       1566;
    }
)

// ************************************************************************* //
